package day1;

public class ArraySort {

    public static void main(String[] args) {
        //排序数组目的一般都是为了快速查找
        //1.时间复杂度:分析关键字的比较次数和移动次数
        //2.空间复杂度:分析排序算法需要多少辅助内存
        //3.稳定性:值一样的值，排序后的位置不变
        /*排序算法分类
        * 内部排序：在内存中完成
        * 外部排序：磁盘排序，网络排序
        * */
        /*算法的五特征
        * 1.输入：有0个或多个输入数据,这些输入必须有清楚的描述和定义
        * 2.输出：有0个或多个输出数据,这些输出必须有清楚的描述和定义
        * 3有穷性：算法必须处理有限个输入数据，并产生有限个输出数据
        * 4.确定性：算法每一步都有确定的含义
        * 可行性：算法的每一步禽畜可行的，能让用户用纸笔而求出答案
        * */

    }
}
